prodotto-kar/src/main/resources/NoPlugin/Esempi/DCSanita_CRM_2005-01_registraAutorizzazioniCittadino.in.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance" xmlns:xsd="http://www.w3.org/1999/XMLSchema" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" soap-env:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
	<soap-env:Header>
		<t:CoopContext xmlns:t="http://www.crs.lombardia.it/schemas/mw/2004-01/coopcontext/">
			<Transport>
				<Mode>Sync</Mode>
				<Dest>DCSanita</Dest>
			</Transport>
			<Security>
				<FunContext>
					<credential>
						<vrs>
							<mjr>2</mjr>
							<min>1</min>
						</vrs>
						<validity>
							<emittedDate>02/03/2004 16:53:05</emittedDate>
							<sessionMaxTime>28800000</sessionMaxTime>
						</validity>
						<role>
							<code>12</code>
							<description>AMMINISTRATIVO ASL-AO</description>
						</role>
						<userId>VRDGTN68C01F205O</userId>
						<FirstName>GAETANO </FirstName>
						<LastName>VERDI </LastName>
						<ctf>
							<reg>
								<cod>030</cod>
								<des>LOMBARDIA</des>
							</reg>
							<app>
								<cod>001</cod>
								<des>SISS</des>
							</app>
							<pro>
								<cod>015</cod>
								<des>MILANO</des>
							</pro>
							<ter>
								<cod>030309</cod>
								<des>ASL MILANO1</des>
							</ter>
							<str>
								<cod>030974</cod>
								<des>AO SALVINI</des>
							</str>
							<pre>
								<cod>03007300</cod>
								<des>OSPEDALE DI CIRCOLO</des>
							</pre>
							<rep>
								<cod>4301</cod>
								<des>UROLOGIA</des>
							</rep>
						</ctf>
						<prv>
							<iup>00000</iup>
							<DF>V</DF>
							<Ref>VERDI/GAETANO/VRDGTN68C01F205O/1328</Ref>
						</prv>
					</credential>
				</FunContext>
				<CitCardPresent>false</CitCardPresent>
				<CitAuth>false</CitAuth>
				<CitCF>CITUNO01R01F251C</CitCF>
				<CitSmartCardSN>251CC001</CitSmartCardSN>
			</Security>
			<Sla>
				<Log>
					<Global>
						<TrackID>1132048757203</TrackID>
						<Timestamp>15/11/2005+10:59:18,562</Timestamp>
					</Global>
				</Log>
			</Sla>
		</t:CoopContext>
		<a:AppContext xmlns:a="http://www.crs.lombardia.it/schemas/mw/2004-01/appcontext/">
			<Request clientProd="DCSanita" clientVer="9.1"/>
		</a:AppContext>
	</soap-env:Header>
	<soap-env:Body>
		<m:CRM.registraAutorizzazioniCittadino xmlns:m="http://www.crs.lombardia.it/schemas/DCSanita/CRM/2005-01/registraAutorizzazioniCittadino/" dataSetVersion="1.1">
			<registraAutorizzazioniCittadino>
				<ll:CRSlegalContent xmlns:ll="http://www.crs.lombardia.it/schemas/mw/2004-01/legalContent/" type="Text" opLegSign="true" opWeakSign="false" feSign="false" verify="OK" tStamp="true">
					<Value>TUlNTU8=</Value>
					<VerifyInfo>
						<Value>base64.blob</Value>
						<Sign actor="OpLeg" result="OK">
							<DN>DistinguishedName</DN>
							<Expiry>ExpiryDateTime</Expiry>
							<Serial>SerialNumber</Serial>
							<Role>Ruolo</Role>
							<CN>CommonName</CN>
							<SigningTime>12-01-2003 12:12:12</SigningTime>
						</Sign>
						<TimeStampInfo>
							<Stamp>DateTime</Stamp>
							<Payload>base64.blob</Payload>
							<SN>SerialNumber</SN>
							<CADN>DistinguishedName</CADN>
							<CAPolicy>TS</CAPolicy>
							<Hash>blob</Hash>
						</TimeStampInfo>
					</VerifyInfo>
				</ll:CRSlegalContent>
				<at:CRSattachment xmlns:at="http://www.crs.lombardia.it/schemas/mw/2004-01/attachment/"/>
				<st:CRSstream xmlns:st="http://www.crs.lombardia.it/schemas/mw/2004-01/stream/"/>
				<codiceFiscaleCittadino>TSTCRM01T01T001T</codiceFiscaleCittadino>
				<idAssistito/>
				<idCittadinoNonSISS/>
				<uriReferto>URI.REFERTO.PRIMO</uriReferto>
				<noteReperibilita>Note di reperibilità</noteReperibilita>
			</registraAutorizzazioniCittadino>
		</m:CRM.registraAutorizzazioniCittadino>
	</soap-env:Body>
</soap-env:Envelope>
